src/mp_toir/Documents/мп_НарядНаРемонт.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>мп_НарядНаРемонт</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатусОбмена</Name>
					<Type>
						<v8:Type>cfg:EnumRef.мп_СтатусыОбмена</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыНарядаНаРемонт</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВерсияДанныхЕРП</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Работы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ИдентификаторСтроки</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>36</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Работа</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.мп_ЗаданиеНаРемонт</v8:Type>
								<v8:Type>cfg:DocumentRef.РегистрацияДефекта</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Исполнители</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>250</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>УИДДокументаРабота</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>36</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидДокументаРабота</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВыполнениеОперации</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Исполнители</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Ответственный</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИдентификаторСтрокиРаботы</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>36</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/mp_toir/Enums/мп_СтатусыОбмена.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>мп_СтатусыОбмена</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Создан</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КВыгрузкеВКИС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗагруженИзМП</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыгруженВКИС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыгруженВМП</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗагруженИзКИС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КВыгрузкеВМП</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/mp_toir/Enums/СтатусыНарядаНаРемонт.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>СтатусыНарядаНаРемонт</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Создан</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВРаботе</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Выполнен</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/mp_toir/Enums/СтатусыДефектов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>СтатусыДефектов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Зарегистрирован</Name>
					<Comment>Внесена запись о дефекте. Черновик</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отклонен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Признан</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтложеноУстранение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Устранен</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/mp_toir/Documents/РегистрацияДефекта.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>РегистрацияДефекта</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыДефектов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Источник</Name>
					<Type>
						<v8:Type>cfg:EnumRef.мп_ИсточникиДокументов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатусОбмена</Name>
					<Type>
						<v8:Type>cfg:EnumRef.мп_СтатусыОбмена</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбъектЭксплуатации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОбъектыЭксплуатации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КраткоеОписаниеДефекта</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособУстранения</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидДефекта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыДефектов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Критичность</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Мечел_КритичностьДефекта</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерКИС</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>9</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВерсияДанныхЕРП</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтветственныйЗаУстранение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Дефекты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Узел</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.УзлыОбъектовЭксплуатации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Дефект</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Мечел_ДефектыОборудования</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СпособУстранения</Name>
							<Type>
								<v8:Type>cfg:EnumRef.Мечел_СпособыУстраненияДефектов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДефектУстранен</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>1</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаУстранения</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОписаниеУстранения</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИдентификаторСтроки</Name>
							<Type>
								<v8:Type>v8:UUID</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ФиксацияДефекта</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ИдентификаторСтрокиДефекта</Name>
							<Type>
								<v8:Type>v8:UUID</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИдентификаторСтрокиФиксацииДефекта</Name>
							<Type>
								<v8:Type>v8:UUID</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ФотоДефекта</Name>
							<Comment>Для выгрузки в ЕРП</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ФотоДефектаПредставление</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИмяФайла</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РасширениеФайла</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>УдалитьСтроку</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ФиксацияУстранения</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ИдентификаторСтрокиДефекта</Name>
							<Type>
								<v8:Type>v8:UUID</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИдентификаторСтрокиУстраненияДефекта</Name>
							<Type>
								<v8:Type>v8:UUID</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ФотоУстранения</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ФотоУстраненияПредставление</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИмяФайла</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РасширениеФайла</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>УдалитьСтроку</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/mp_toir/Documents/мп_НарядНаРемонт/Forms/ФормаДокумента/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	Если Параметры.Ключ.Пустая() Тогда
		РеквизитыКонстант = ОбщегоНазначенияСервер.ПолучитьЗначенияКонстант();
		Объект.Подразделение = РеквизитыКонстант["ПодразделениеПользователя"];
		Объект.Ответственный = РеквизитыКонстант["ТекущийПользователь"];
		Объект.СтатусОбмена = Перечисления.мп_СтатусыОбмена.Создан;
		Объект.Статус = Перечисления.СтатусыНарядаНаРемонт.Создан;
	КонецЕсли;

	ДоступностьРеквизитов();
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)

	ЧтениеНаСервере();

КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	ЧтениеНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	Если ИсточникВыбора.ИмяФормы = "Документ.мп_НарядНаРемонт.Форма.ФормаРедактированияСтрокиРабота" Тогда
		ДанныеСтроки = Объект.Работы.НайтиПоИдентификатору(ИсточникВыбора.НомерСтроки);
		Если ДанныеСтроки = Неопределено Тогда
			Возврат;
		КонецЕсли;
		Если ИсточникВыбора.СохранитьИзменения Тогда
			Модифицированность = Истина;
			ЗаполнитьЗначенияСвойств(ДанныеСтроки, ИсточникВыбора, "Работа");
			ДанныеСтроки.Исполнители = ОбновитьИсполнителей(ИсточникВыбора.Исполнители, ДанныеСтроки.ИдентификаторСтроки);
			ЧтениеНаСервере();
		Иначе
			Если ДанныеСтроки.ЭтоНоваяСтрока Тогда
				НомерСтроки = Объект.Работы.Количество();
				Объект.Работы.Удалить(НомерСтроки - 1);
				ЧтениеНаСервере();
			КонецЕсли;
		КонецЕсли;
	ИначеЕсли ИсточникВыбора.ИмяФормы = "Документ.РегистрацияДефекта.Форма.ФормаПодборДляНаряда"
		Или ИсточникВыбора.ИмяФормы = "Документ.мп_ЗаданиеНаРемонт.Форма.ФормаПодборДляНаряда" Тогда
		Если ИсточникВыбора.СохранитьИзменения Тогда
			Модифицированность = Истина;
			ЗаполнитьИзПодбора(ИсточникВыбора.ВыбранныеДокументы);
			ЧтениеНаСервере();
		КонецЕсли;
	ИначеЕсли ИсточникВыбора.ИмяФормы = "Документ.РегистрацияДефекта.Форма.ФормаДокумента"
		Или ИсточникВыбора.ИмяФормы = "Документ.мп_ЗаданиеНаРемонт.Форма.ФормаДокумента" Тогда
		Если ИсточникВыбора.ОткрытИзНаряда Тогда
			ЭтотОбъект.Прочитать();
			ЭтотОбъект.ОбновитьОтображениеДанных();
			Если ТипЗнч(ИсточникВыбора.Объект.Ссылка) = Тип("ДокументСсылка.мп_ЗаданиеНаРемонт") Тогда
				ДанныеСтроки = Объект.Работы.НайтиПоИдентификатору(ИсточникВыбора.НомерСтрокиНаряда);
				ДанныеСтроки.Исполнители = ОбновитьИсполнителей(
					ИсточникВыбора.Объект.Исполнители, ДанныеСтроки.ИдентификаторСтроки);
			КонецЕсли;
		КонецЕсли;
	ИначеЕсли ИсточникВыбора.ИмяФормы = "Справочник.Пользователи.Форма.ФормаВыбораИзДокумента" Тогда
		Если ИсточникВыбора.СохранитьИзменения Тогда
			Модифицированность = Истина;
			ВыбранныеИсполнители(ИсточникВыбора.Ответственный);
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыРаботы

&НаКлиенте
Процедура ДобавитьРаботу(Команда)
	ДобавитьРаботуНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура РаботыПередНачаломИзменения(Элемент, Отказ)
	Отказ = Истина;
КонецПроцедуры


&НаКлиенте
Процедура ИзменитьРаботу(Команда)
	Строка = Элементы.Работы.ТекущиеДанные;
	Строка.ЭтоНоваяСтрока = Ложь;
	ОткрытьФормуРедактированияСтрокаРабота(Строка);
КонецПроцедуры

&НаКлиенте
Процедура УдалитьРаботу(Команда)
	ИндексСтроки = Элементы.Работы.ТекущиеДанные.НомерСтроки - 1;
	УдалитьИсполнителей(Элементы.Работы.ТекущиеДанные.ИдентификаторСтроки);
	Объект.Работы.Удалить(ИндексСтроки);
	Модифицированность = Истина;
КонецПроцедуры

&НаКлиенте
Асинх Процедура ПодборРабот(Команда)

	СписокВыбора = Новый СписокЗначений;
	СписокВыбора.Добавить("Регистрация дефекта");
	СписокВыбора.Добавить("Задание на ремонт");
	ВыбранноеЗначение = Ждать СписокВыбора.ВыбратьЭлементАсинх("Вид документа");
	Если ВыбранноеЗначение = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ДанныеДляФормы = Новый Структура;
	ДанныеДляФормы.Вставить("Подразделение", Объект.Подразделение);
	ДанныеДляФормы.Вставить("ИсключаемыеДокументы", ИсключатьИзПодбора(ВыбранноеЗначение.Значение));
	Если ВыбранноеЗначение.Значение = "Регистрация дефекта" Тогда
		ДанныеДляФормы.Вставить("Статус", ПредопределенноеЗначение("Перечисление.СтатусыДефектов.Зарегистрирован"));
		ОткрытьФорму("Документ.РегистрацияДефекта.Форма.ФормаПодборДляНаряда",
			ДанныеДляФормы, ЭтотОбъект, ЭтотОбъект.УникальныйИдентификатор, , , , РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	ИначеЕсли ВыбранноеЗначение.Значение = "Задание на ремонт" Тогда
		
		ОткрытьФорму("Документ.мп_ЗаданиеНаРемонт.Форма.ФормаПодборДляНаряда",
			ДанныеДляФормы, ЭтотОбъект, ЭтотОбъект.УникальныйИдентификатор, , , , РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ОткрытьРаботу(Команда)
	Если Не ЗначениеЗаполнено(Объект.Ссылка) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(
			"Перед открытием работы запишите наряд");
		Возврат;
	КонецЕсли;
	Если Модифицированность Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(
			"Перед открытием работы запишите наряд");
		Возврат;
	КонецЕсли;
	РаботаСсылка = Элементы.Работы.ТекущиеДанные.Работа;
	Если ЗначениеЗаполнено(РаботаСсылка) Тогда
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("Ключ", РаботаСсылка);
		ПараметрыФормы.Вставить("ОткрытИзНаряда", Истина);
		ПараметрыФормы.Вставить("НомерСтрокиНаряда", Элементы.Работы.ТекущиеДанные.ПолучитьИдентификатор());
		
		ОткрытьФорму("Документ." + ИмяДокументаПоСсылке(РаботаСсылка) + ".ФормаОбъекта", ПараметрыФормы,
			ЭтотОбъект, ЭтотОбъект.УникальныйИдентификатор, , , , РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ЗаполнитьИсполнителей(Команда)
	ДанныеСтроки = Новый Структура;
	ДанныеСтроки.Вставить("НомерСтроки", Новый УникальныйИдентификатор);
	ДанныеСтроки.Вставить("ТаблицаРаботы", Истина);
	ПраваДоступа = ОбщегоНазначенияВызовСервера.ДоступныеПрава();
	Если Не ПраваДоступа.АдминТОиР Тогда
		ДанныеСтроки.Вставить("Подразделение", Объект.Подразделение);
	КонецЕсли;

	ОткрытьФорму("Справочник.Пользователи.Форма.ФормаВыбораИзДокумента",
		ДанныеСтроки, ЭтотОбъект, ЭтотОбъект.УникальныйИдентификатор, , , , РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции
&НаСервере
Процедура ВыбранныеИсполнители(Знач ИсполнителиИзФормыПодбора)

	ТЗИсполнители = Объект.Исполнители.Выгрузить();
	Для Каждого ТекРабота Из Объект.Работы Цикл
		Отбор = Новый Структура;
		Отбор.Вставить("ИдентификаторСтрокиРаботы", ТекРабота.ИдентификаторСтроки);
		НайденныеИсполнители = ТЗИсполнители.НайтиСтроки(Отбор);
		Для Каждого ТекИсполнитель Из НайденныеИсполнители Цикл
			ТЗИсполнители.Удалить(ТекИсполнитель);
		КонецЦикла;
		Ответственные = Новый Массив;
		Для Каждого ИсполнительИзФормы Из ИсполнителиИзФормыПодбора Цикл
			Ответственные.Добавить(Строка(ИсполнительИзФормы));
			НоваяСтрока = ТЗИсполнители.Добавить();
			НоваяСтрока.ИдентификаторСтрокиРаботы = ТекРабота.ИдентификаторСтроки;
			НоваяСтрока.Ответственный = ИсполнительИзФормы.Значение;
		КонецЦикла;
		ТекРабота.Исполнители = СтрСоединить(Ответственные, ", ");
	КонецЦикла;
	Объект.Исполнители.Загрузить(ТЗИсполнители);
КонецПроцедуры

&НаСервереБезКонтекста
Функция ИмяДокументаПоСсылке(Знач ДокументСсылка)

	Возврат ДокументСсылка.Метаданные().Имя;

КонецФункции

&НаСервере
Функция ИсключатьИзПодбора(Знач ВыбранноеЗначение)
	ТЗРаботы = Объект.Работы.Выгрузить();
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ТЗРаботы.Работа КАК Работа
	|ПОМЕСТИТЬ вт_Работы
	|ИЗ
	|	&ТЗРаботы КАК ТЗРаботы
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	вт_Работы.Работа КАК Работа,
	|	""Из ТЗРабота регистрация дефекта"" КАК Пояснение
	|ИЗ
	|	вт_Работы КАК вт_Работы
	|ГДЕ
	|	&ВыбранноеЗначение ПОДОБНО ""%Регистрация дефекта%""
	|	И вт_Работы.Работа ССЫЛКА Документ.РегистрацияДефекта
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	вт_Работы.Работа,
	|	""Из ТЗРабота задание на ремонт""
	|ИЗ
	|	вт_Работы КАК вт_Работы
	|ГДЕ
	|	&ВыбранноеЗначение ПОДОБНО ""%Задание на ремонт%""
	|	И вт_Работы.Работа ССЫЛКА Документ.мп_ЗаданиеНаРемонт
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	мп_НарядНаРемонтРаботы.Работа,
	|	""в других нарядах ищем регистр дефекта""
	|ИЗ
	|	Документ.мп_НарядНаРемонт.Работы КАК мп_НарядНаРемонтРаботы
	|ГДЕ
	|	&ВыбранноеЗначение ПОДОБНО ""%Регистрация дефекта%""
	|	И мп_НарядНаРемонтРаботы.Работа ССЫЛКА Документ.РегистрацияДефекта
	|	И НЕ мп_НарядНаРемонтРаботы.Ссылка.ПометкаУдаления
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	мп_НарядНаРемонтРаботы.Работа,
	|	""в других нарядах ищем зад на ремонт""
	|ИЗ
	|	Документ.мп_НарядНаРемонт.Работы КАК мп_НарядНаРемонтРаботы
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.мп_ЗаданиеНаРемонт КАК мп_ЗаданиеНаРемонт
	|		ПО ((ВЫРАЗИТЬ(мп_НарядНаРемонтРаботы.Работа КАК Документ.мп_ЗаданиеНаРемонт)) = мп_ЗаданиеНаРемонт.Ссылка)
	|			И (НЕ мп_ЗаданиеНаРемонт.ВыполнениеОперации = """"""Нет"""""")
	|ГДЕ
	|	&ВыбранноеЗначение ПОДОБНО ""%Задание на ремонт%""
	|	И НЕ мп_НарядНаРемонтРаботы.Ссылка = &ТекущийДокумент
	|	И НЕ мп_НарядНаРемонтРаботы.Ссылка.ПометкаУдаления";
	
	Запрос.УстановитьПараметр("ВыбранноеЗначение", ВыбранноеЗначение);
	Запрос.УстановитьПараметр("ТЗРаботы", ТЗРаботы);
	Запрос.УстановитьПараметр("ТекущийДокумент", Объект.Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();

	Возврат РезультатЗапроса.Выгрузить().ВыгрузитьКолонку("Работа");
	
КонецФункции

&НаСервере
Процедура ЗаполнитьИзПодбора(Знач ВыбранныеДокументы)
	
	Для Каждого ТекСтрока Из ВыбранныеДокументы Цикл
		НоваяСтрока = Объект.Работы.Добавить();
		НоваяСтрока.ИдентификаторСтроки = Строка(Новый УникальныйИдентификатор());
		НоваяСтрока.Работа = ТекСтрока.Значение;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура УдалитьИсполнителей(Знач ИдентификаторСтроки)

	ТЗИсполнители = Объект.Исполнители.Выгрузить();

	Отбор = Новый Структура;
	Отбор.Вставить("ИдентификаторСтрокиРаботы", ИдентификаторСтроки);
	СтрокиИсполнителей = ТЗИсполнители.НайтиСтроки(Отбор);
	Для Каждого ТекСтрока Из СтрокиИсполнителей Цикл
		ТЗИсполнители.Удалить(ТекСтрока);
	КонецЦикла;
	Объект.Исполнители.Загрузить(ТЗИсполнители);

КонецПроцедуры

&НаСервере
Функция ОбновитьИсполнителей(Знач ИсполнителиПоРаботе, Знач ИдентификаторСтрокиПоРаботе)
	ТЗИсполнители = Объект.Исполнители.Выгрузить();
	
	Отбор = Новый Структура;
	Отбор.Вставить("ИдентификаторСтрокиРаботы", ИдентификаторСтрокиПоРаботе);
	СтрокиИсполнителей = ТЗИсполнители.НайтиСтроки(Отбор);
	Для Каждого ТекСтрока Из СтрокиИсполнителей Цикл
		ТЗИсполнители.Удалить(ТекСтрока);
	КонецЦикла;
	Ответственные = Новый Массив;
	Для Каждого ТекСтрока Из ИсполнителиПоРаботе Цикл
		НоваяСтрока = ТЗИсполнители.Добавить();
		НоваяСтрока.Ответственный = ТекСтрока.Ответственный;
		НоваяСтрока.ИдентификаторСтрокиРаботы = ИдентификаторСтрокиПоРаботе;
		Ответственные.Добавить(ТекСтрока.Ответственный);
	КонецЦикла;
	Объект.Исполнители.Загрузить(ТЗИсполнители);
	
	Возврат СтрСоединить(Ответственные, ", ");
	
КонецФункции

&НаКлиенте
Процедура ДобавитьРаботуНаСервере()
	СтрокаРабота = Объект.Работы.Добавить();
	СтрокаРабота.ЭтоНоваяСтрока = Истина;
	СтрокаРабота.ИдентификаторСтроки = Строка(Новый УникальныйИдентификатор());
	ОткрытьФормуРедактированияСтрокаРабота(СтрокаРабота);
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуРедактированияСтрокаРабота(Знач Строка)

	ДанныеСтроки = Новый Структура;
	ДанныеСтроки.Вставить("Работа", Строка.Работа);
	ДанныеСтроки.Вставить("Ответственный", Строка.Исполнители);
	ДанныеСтроки.Вставить("ИдентификаторСтроки", Строка.ИдентификаторСтроки);
	ДанныеСтроки.Вставить("НомерСтроки", Строка.ПолучитьИдентификатор());

	ДанныеСтроки.Вставить("ТолькоПросмотр", ТолькоПросмотрСтроки());
	ДанныеСтроки.Вставить("СтатусОбмена", Объект.СтатусОбмена);
	ДанныеСтроки.Вставить("Статус", Объект.Статус);
	ДанныеСтроки.Вставить("Подразделение", Объект.Подразделение);
	ДанныеСтроки.Вставить("Исполнители", ИсполнителиПоСтроке(Строка.ИдентификаторСтроки));

	ОткрытьФорму("Документ.мп_НарядНаРемонт.Форма.ФормаРедактированияСтрокиРабота",
		ДанныеСтроки, ЭтотОбъект, ЭтотОбъект.УникальныйИдентификатор, , , , РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);

КонецПроцедуры

&НаСервере
Функция ИсполнителиПоСтроке(Знач ИдентификаторСтроки)

	ИсполнителиПоСтроке = Объект.Исполнители.Выгрузить();
	Отбор = Новый Структура;
	Отбор.Вставить("ИдентификаторСтрокиРаботы", ИдентификаторСтроки);
	Результат = ИсполнителиПоСтроке.Скопировать(Отбор);
	Возврат Результат.ВыгрузитьКолонку("Ответственный");

КонецФункции

&НаСервере
Процедура ЧтениеНаСервере()

	ТЗРаботы = СтатусВыполненияРаботы(Объект.Работы.Выгрузить());
	Для Каждого ТекСтрока Из Объект.Работы Цикл
		СтрокаВыполненныхРабот = ТЗРаботы.Найти(ТекСтрока.Работа);
		Если Не СтрокаВыполненныхРабот = Неопределено Тогда
			ТекСтрока.ВыполнениеОперации = СтрокаВыполненныхРабот.ВыполнениеОперации;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция СтатусВыполненияРаботы(Знач ТЗРаботы)

	Запрос = Новый Запрос;

	Запрос.УстановитьПараметр("ТЗРаботы", ТЗРаботы);

	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ТЗРаботы.Работа КАК Работа
	|ПОМЕСТИТЬ вт_Работы
	|ИЗ
	|	&ТЗРаботы КАК ТЗРаботы
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	вт_Работы.Работа КАК Работа,
	|	ВЫБОР
	|		КОГДА РегистрацияДефекта.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыДефектов.Зарегистрирован)
	|			ТОГДА ""Зарегистрирован""
	|		КОГДА РегистрацияДефекта.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыДефектов.Отклонен)
	|			ТОГДА ""Отклонен""
	|		КОГДА РегистрацияДефекта.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыДефектов.Признан)
	|			ТОГДА ""Признан""
	|		КОГДА РегистрацияДефекта.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыДефектов.ОтложеноУстранение)
	|			ТОГДА ""ОтложеноУстранение""
	|		КОГДА РегистрацияДефекта.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыДефектов.Устранен)
	|			ТОГДА ""Устранен""
	|		ИНАЧЕ """"
	|	КОНЕЦ КАК ВыполнениеОперации
	|ИЗ
	|	Документ.РегистрацияДефекта КАК РегистрацияДефекта
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ вт_Работы КАК вт_Работы
	|		ПО ((ВЫРАЗИТЬ(вт_Работы.Работа КАК Документ.РегистрацияДефекта)) = РегистрацияДефекта.Ссылка)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	вт_Работы.Работа,
	|	мп_ЗаданиеНаРемонт.ВыполнениеОперации
	|ИЗ
	|	Документ.мп_ЗаданиеНаРемонт КАК мп_ЗаданиеНаРемонт
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ вт_Работы КАК вт_Работы
	|		ПО ((ВЫРАЗИТЬ(вт_Работы.Работа КАК Документ.мп_ЗаданиеНаРемонт)) = мп_ЗаданиеНаРемонт.Ссылка)";

	Результат = Запрос.Выполнить();
	
	Возврат Результат.Выгрузить();
	
КонецФункции

&НаСервере
Процедура ДоступностьРеквизитов()

	ПраваДоступа = ОбщегоНазначенияВызовСервера.ДоступныеПрава();

	ТолькоПросмотрСтроки = ТолькоПросмотрСтроки();

	ДоступноДляРедактирования = Новый Массив;
	ДоступноДляРедактирования.Добавить("ФормаКоманднаяПанель");
	ДоступноДляРедактирования.Добавить("ФормаПровестиИЗакрыть");
	Если ПраваДоступа.АдминТОиР Тогда
		ДоступноДляРедактирования.Добавить("Подразделение");
	КонецЕсли;
	
	ДоступноДляРедактирования.Добавить("Работы");
	ДоступноДляРедактирования.Добавить("РаботыКонтекстноеМеню");
	Если Не ТолькоПросмотрСтроки Тогда
		ДоступноДляРедактирования.Добавить("РаботыКоманднаяПанель");
		ДоступноДляРедактирования.Добавить("РаботыПодборРабот");
		ДоступноДляРедактирования.Добавить("РаботыПоказатьПерестановкуСтрок");
		ДоступноДляРедактирования.Добавить("РаботыКонтекстноеМенюОткрытьРаботу");
		ДоступноДляРедактирования.Добавить("РаботыГруппаОбщая");
		ДоступноДляРедактирования.Добавить("РаботыГруппаНомерСтроки");
	КонецЕсли;
	
	Если ПраваДоступа.МеханикТОиР Тогда
		ДоступноДляРедактирования.Добавить("РаботыКонтекстноеМенюОткрытьРаботу");
	КонецЕсли;

	ЗакрытьДляРедактирования = Новый Массив;
	ЗакрытьДляРедактирования = 
		ОбщегоНазначения.ЗапрещаемыеЭлементы(Элементы, ДоступноДляРедактирования, ЗакрытьДляРедактирования);

	ОбщегоНазначенияУТКлиентСервер.УстановитьСвойствоЭлементовФормы(
		Элементы, ДоступноДляРедактирования, "Доступность", Истина, Истина);

	Если ТолькоПросмотрСтроки Или ПраваДоступа.МеханикТОиР Тогда
		ЗакрытьДляРедактирования.Добавить("РаботыКонтекстноеМенюУдалитьРаботу");
	КонецЕсли;

	ОбщегоНазначенияУТКлиентСервер.УстановитьСвойствоЭлементовФормы(
		Элементы, ЗакрытьДляРедактирования, "Доступность", Ложь);

КонецПроцедуры

&НаСервере
Функция ТолькоПросмотрСтроки()

	ПраваДоступа = ОбщегоНазначенияВызовСервера.ДоступныеПрава();
	Если Не Объект.Статус = ПредопределенноеЗначение("Перечисление.СтатусыНарядаНаРемонт.Создан")
			Или ПраваДоступа.ПросмотрТОиР Тогда
		УстановитьПросмотр = Истина;
	Иначе
		УстановитьПросмотр = Ложь;
	КонецЕсли;

	Возврат УстановитьПросмотр;

КонецФункции

&НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	АктуальныеРежимы = Новый Массив;
	АктуальныеРежимы.Добавить(РежимЗаписиДокумента.Запись);
	АктуальныеРежимы.Добавить(РежимЗаписиДокумента.Проведение);
	Если Не АктуальныеРежимы.Найти(ПараметрыЗаписи.РежимЗаписи) = Неопределено Тогда
		ТаблицаИсполнителей = Объект.Исполнители.Выгрузить();
		Для Каждого ТекСтрока Из Объект.Работы Цикл
			Отбор = Новый Структура;
			Отбор.Вставить("ИдентификаторСтрокиРаботы", ТекСтрока.ИдентификаторСтроки);
			СписокИсполнителей = ТаблицаИсполнителей.Скопировать(Отбор);
			ЗаменаИсполнителей(ТекСтрока.Работа, СписокИсполнителей);
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ЗаменаИсполнителей(Работа, СписокИсполнителей)
	РаботаОбъект = Работа.ПолучитьОбъект();
	Если ТипЗнч(Работа) = Тип("ДокументСсылка.мп_ЗаданиеНаРемонт") Тогда
		РаботаОбъект.Исполнители.Очистить();
		Для Каждого ТекСтрока Из СписокИсполнителей Цикл
			НоваяСтрока = РаботаОбъект.Исполнители.Добавить();
			НоваяСтрока.Ответственный = ТекСтрока.Ответственный;
		КонецЦикла;
		РаботаОбъект.Записать(РежимЗаписиДокумента.Запись);
	Иначе
		Возврат;
	КонецЕсли;
КонецПроцедуры

#КонецОбласти
